import "./Privacy.css";

const Privacy = () => {
  return (
    <div className="container privacy-container">
      <h1>개인정보 처리방침</h1>
      <p>
        <h2>샴고양이 개인정보 처리 방침</h2>
        <p>샴고양이 디스코드 봇(이하 "샴고양이"라 함)는 개인정보보호법을 준수하며, 관련 법령에 의거한 개인정보처리방침을 정하여 이용자 권익 보호에 최선을 다하고 있습니다.</p>
        <p>샴고양이의 개인정보처리방침은 다음과 같은 내용을 담고 있습니다.</p>
        <ul>
          <li>1. 처리하는 개인정보 항목</li>
          <li>2. 개인정보의 처리목적</li>
          <li>3. 개인정보의 제3자 제공</li>
          <li>4. 개인정보의 처리 및 보유기간</li>
          <li>5. 개인정보 파기절차 및 방법</li>
          <li>6. 정보주체의 권리·의무 및 그 행사방법</li>
          <li>7. 개인정보의 안전성 확보조치</li>
          <li>8. 개인정보 자동 수집 장치의 설치ㆍ운영 및 거부에 관한 사항</li>
          <li>9. 개인정보보호 책임자 및 연락처</li>
          <li>10 개인정보처리방침의 변경</li>
        </ul>
      </p>
      <hr />
      <p>
        <h2>1. 처리하는 개인정보 항목</h2>
        <p>
        첫째, 샴고양이는 디스코드 봇 서비스를 위해 아래와 같은 개인정보를 수집하고 있습니다.
        - 메시지 ID, 서버 ID, 서버 채널 ID, 사용자 ID, 사용자 서버 내의 역할 ID
        </p>
        <p>
        그리고 서비스 이용과정이나 사업처리 과정에서 아래와 같은 정보들이 자동으로 생성되어 수집될 수 있습니다.
        - 이용자의 브라우저 종류 및 OS, 방문 기록(IP Address, 접속시간), 쿠키
        </p>
        <p>
        샴고양이는 샴고양이가 포함된 디스코드 서버 내에서의 사용자 입력 혹은 홈페이지(https://para.n-e.kr) 웹문서를 통한 사용자 입력 방법으로 개인정보를 수집합니다.
        </p>
      </p>
      <hr />
      <p>
        <h2>2. 개인정보의 처리목적</h2>
        <p>가. 샴고양이 명령어 사용시의 서비스 제공 목적</p>
      </p>
      <hr />
      <p>
        <h2>3. 개인정보의 제3자 제공</h2>
        <p>샴고양이는 개인정보를 "2. 개인정보의 처리목적"에서 고지한 범위내에서 사용하며, 정보주체의 사전 동의 없이는 동 범위를 초과하여 이용하거나 원칙적으로 개인정보를 외부에 공개하지 않습니다. 다만, 아래의 경우에는 예외로 합니다.</p>
        <p>- 정보주체가 사전에 동의한 경우</p>
        <p>- 법령의 규정에 의거하거나, 수사 목적으로 법령에 정해진 절차와 방법에 따라 수사기관의 요구가 있는 경우</p>
      </p>
      <hr />
      <p>
        <h2>4. 개인정보의 처리 및 보유기간</h2>
        <p>정보주체로부터 개인정보를 수집시에 동의받은 개인정보 보유/이용 기간 내에서 개인정보를 처리 및 보유하며, 원칙적으로 개인정보의 처리목적이 달성되면 지체 없이 파기합니다.</p>
      </p>
      <hr />
      <p>
        <h2>5. 개인정보 파기절차 및 방법</h2>
        <p>개인정보는 원칙적으로 개인정보의 처리목적이 달성되면 지체 없이 파기합니다. 샴고양이의 개인정보 파기절차 및 방법은 다음과 같습니다.</p>
        <p>가. 파기절차</p>
        <p>- 정보주체가 입력한 정보는 목적이 달성된 후 별도의 DB로 옮겨져(종이의 경우 별도의 서류함) 내부 방침 및 기타 관련 법령에 의한 보관사유에 따라("5. 개인정보의 처리 및 보유기간" 참조)일정 기간 저장된 후 파기됩니다.</p>
        <p>- 동 개인정보는 법률에 의한 경우가 아니고서는 보유되는 이외의 다른 목적으로 이용되지 않습니다.</p>
        <p>나. 파기방법</p>
        <p>- 종이에 출력된 개인정보는 분쇄기로 분쇄하거나 소각을 통하여 파기합니다.</p>
        <p>- 전자적 파일 형태로 저장된 개인정보는 기록을 재생할 수 없는 기술적 방법을 사용하여 삭제합니다.</p>
      </p>
      <hr />
      <p>
        <h2>6. 정보주체의 권리·의무 및 그 행사방법</h2>
        <p>정보주체는 언제든지 등록되어 있는 자신의 개인정보를 조회하거나 수정할 수 있으며 정보삭제 및 처리정지를 요청할 수도 있습니다. 정보삭제 또는 처리정지를 원하시는 경우 개인정보보호 책임자에게 이메일로 연락하시면 지체 없이 조치하겠습니다.</p>
      </p>
      <hr />
      <p>
        <h2>7. 개인정보의 안전성 확보조치</h2>
        <p>샴고양이는 개인정보를 처리함에 있어 개인정보가 분실, 도난, 누출, 변조 또는 훼손되지 않도록 안전성 확보를 위하여 다음과 같은 보호조치를 강구하고 있습니다.</p>
        <p>1. 관리적 조치</p>
        <p>내부관계획 수립/시행, 정기적인 취급자 교육 등 </p>
        <p>2. 기술적 조치</p>
        <p>개인정보처리시스템 등의 접근권한 관리, 접근통제 시스템 설치, 주요 개인정보의 암호화, 보안프로그램 설치</p>
        <p>3. 물리적 조치</p>
        <p>전산실, 자료보관실 등의 접근통제</p>
      </p>
      <hr />
      <p>
        <h2>8. 개인정보 자동 수집 장치의 설치ㆍ운영 및 거부에 관한 사항</h2>
        <p>샴고양이는 웹서비스를 제공하기 위해 ‘쿠키(cookie)’ 를 사용합니다. 쿠키는 웹사이트를 운영하는데 이용되고 서버가 이용자의 컴퓨터 브라우저에서 보내는 소량의 정보이며 이용자들의 PC 내의 하드디스크에 저장될 수 있습니다.</p>
        <p>가. 쿠키의 사용목적</p>
        <p>이용자가 방문한 웹페이지 대한 방문 및 이용형태, 보안접속 여부 등을 파악하기 위해 사용합니다.</p>
        <p>나. 쿠키의 설치ㆍ운영 및 거부</p>
        <p>웹브라우저 상단의 도구&gt;인터넷 옵션&gt;개인정보 메뉴의 옵션 설정을 통해 쿠키 저장을 거부 할 수 있습니다. 쿠키 저장을 거부할 경우 별도 불이익은 없습니다.</p>
      </p>
      <hr />
      <p>
        <h2>9. 개인정보보호 책임자 및 연락처</h2>
        <p>귀하께서는 홈페이지 등을 이용하시는 과정에서 발생하는 모든 개인정보보호 관련 민원을 개인정보보호 책임자에게 신고하실 수 있습니다. 샴고양이는 이용자들의 신고사항에 대해 신속하게 충분한 답변을 드릴 것입니다.</p>
        <p>개인정보보호 책임자 및 연락처</p>
        <p>이 름 김민규</p>
        <p>메 일 saiyu915@naver.com</p>
        <p>기타 개인정보침해에 대한 신고나 상담이 필요하신 경우에는 아래 기관에 문의하시기 바랍니다.</p>
        <p>개인정보침해신고센터 ( http://privacy.kisa.or.kr / 국번없이 118 )</p>
        <p>대검찰청 사이버수사과 ( http://www.spo.go.kr / 국번없이 1301 )</p>
        <p>경찰청 사이버수사국 ( https://ecrm.cyber.go.kr / 국번없이 182 )</p>
      </p>
      <hr />
      <p>
        <h2>10. 개인정보처리방침의 변경</h2>
        <p>현 개인정보처리방침의 내용 추가, 삭제 및 수정이 있을 시에는 개정 최소 7일전부터 홈페이지 '공지사항'을 통해 고지할 것입니다. 다만, 개인정보의 수집 및 활용, 제3자 제공 등과 같이 이용자 권리의 중요한 변경이 있을 경우에는 최소 30일전에 고지합니다</p>
        <p>- 공고 일자 : 2022년 03월 09일</p>
        <p>- 시행 일자 : 2022년 03월 09일</p>
      </p>
    </div>
  )
}

export default Privacy;
